Testru

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:v01="http://com/rbsg/soa/C040PaymentManagement/CustomerRetrievalForPayment/V01/">
    <soapenv:Header/>
    <soapenv:Body>
        <!-- ✅ Only this tag has v01: prefix -->
        <v01:retrievePrimaryCustomerForArr xmlns="">
            <!-- All child elements have no namespace -->
            <requestHeader>
                <operatingBrand>NWB</operatingBrand>
                <requestIds>
                    <systemId>RequestID</systemId>
                    <transactionId>123456789</transactionId>
                </requestIds>
                <requestIds>
                    <systemId>SourceID</systemId>
                    <transactionId>ISO</transactionId>
                </requestIds>
                <cmdType>Request</cmdType>
            </requestHeader>
            <processingParameter>
                <objectReference>
                    <identifier>NWB</identifier>
                    <context>
                        <schemeName>OrganizationEnterpriseIdType</schemeName>
                        <codeValue>OperatingBrandIdentifier</codeValue>
                    </context>
                </objectReference>
            </processingParameter>
            <arrangementIdentifier>
                <identifier>600001457620742222</identifier>
                <context>
                    <schemeName>ArrangementEnterpriseIdType</schemeName>
                    <codeValue>UKBasicBankAccountNumber</codeValue>
                    <description>aslkjdslahbkjdf</description>
                </context>
                <description>aslkjdslahbkjdf</description>
            </arrangementIdentifier>
        </v01:retrievePrimaryCustomerForArr>
    </soapenv:Body>
</soapenv:Envelope>
